[
  {
    "code": "IST20 1001",

    "name": "การรู้ดิจิทัล",

    "credit": "2(2-0-4)",

    "prereqs": "ไม่มี",
    "prereqs_list": [],

    "description": "การเลือกแล่งารนเทเพื่อการค้นค้า การใช้เทคโนโลยีดิจิทัลในการค้นคืนารนเท การรบรมและการประเมินคุณภาพารนเท การิเคราะ์และังเคราะ์ารนเท การเขียนรายงานและการอ้างอิง คามปลอดภัย ผลกระทบ จริยธรรม คุณธรรม และกฎมายที่เกี่ยกับการใช้ื่อและเทคโนโลยีดิจิทัล"
  },

  {
    "code": "IST30 1102",

    "name": "ภาาอังกฤเพื่อการื่อาร 2",

    "credit": "3(3-0-6)",

    "prereqs": "IST30 1101 ภาาอังกฤเพื่อการื่อาร 1",
    "prereqs_list": ["IST30 1101"],

    "description": "พัฒนาคามามารถของนักึกาในระดับทีู่งขึ้น เพื่อการื่อารอย่างมีประิทธิภาพทั้งในสถานการณ์ทางังคมและิชาการ บูรณาการทักะโดยเฉพาะอย่างยิ่งทักะการฟังและการพูดเพื่อจุดประงค์เชิงวืชาการ พัฒนากลยุทธ์การื่อารและกลยุทธ์การเรียนภาา ร้างเริมการเรียนรู้ด้ยตนเอง โดยใช้เนื้อากึ่งิชาการจากแล่งทรัพยากรที่ลากลาย"
  },

  {
    "code": "SCI02 1112",

    "name": "ปฏิบัติการเคมีพื้นฐาน 1",

    "credit": "1(0-3-0)",

    "prereqs": "SCI02 1111 เคมีพื้นฐาน 1 รือเรียนคบคู่กัน รือโดยคามเ็นชอบของาขาิชา",
    "prereqs_list": ["SCI02 1111"],

    "description": "การทดลองใน้องปฏิบัติการที่มีการึกาถึงเทคนิคพื้นฐานในการทำปฏิบัติการเคมี และการทำปฏิบัติการในัข้อต่าง ๆ ได้แก่ มบัติของแก๊ มบัติของของเล แบบจำลองโละ มดุลเคมี การไทเทรตกรด–เบ จลนาตร์เคมี และปฏิกิริยาเคมีแบบต่าง ๆ"
  },

  {
    "code": "SCI05 1192",

    "name": "ปฏิบัติการฟิิก์ 2",

    "credit": "1(0-3-0)",

    "prereqs": "SCI05 1191 ปฏิบัติการฟิิก์ 1 และ SCI05 1002 ฟิิก์ 2 รือผ่านการเรียนSCI05 1191 ปฏิบัติการฟิิก์ 1 มาแล้ และกำลังเรียน SCI05 1002 ฟิิก์ 2 อยู่รือโดยคามเ็นชอบของาขาิชา",
    "prereqs_list": ["SCI05 1191", "SCI05 1002", "SCI05 1191", "SCI05 1002"],

    "description": "เช่นเดียกับิชาปฏิบัติการฟิิก์ 1 แต่ทดลองในเรื่อง แง อิเล็กทรอนิก์ ปรากฏการณ์โฟโตอิเล็กตริกและกัมมันตภาพรัง"
  },

  {
    "code": "ENG23 2032",

    "name": "เทคโนโลยีเชิงัตถุ",

    "credit": "4(3-3-9)",

    "prereqs": "ENG23 2001 การเขียนโปรแกรมคอมพิเตอร์ 2 และ ENG23 2003 การแก้ปัญาด้ยการโปรแกรม",
    "prereqs_list": ["ENG23 2001", "ENG23 2003"],
    "description": "เช่นเดียกับิชาปฏิบัติการฟิิก์ 1 แต่ทดลองในเรื่อง แง อิเล็กทรอนิก์ ปรากฏการณ์โฟโตอิเล็กตริกและกัมมันตภาพรัง"
  }
]
