import unittest

# from main import extract_course_detail
from main import CourseExtractor


class TestCpePage20(unittest.TestCase):
	def test_extract_course_detail(self):
		input_lines = [
			'มคอ.2  ',
			'ด้านเทคโนโลยีและวิธีการทางซอฟต์แวร์ ',
			'ENG23 2031 ',
			'โครงสร้างข้อมูลและขั้นตอนวิธี ',
			'4(4-0-8) ',
			' ',
			'(Data Structures and Algorithms) ',
			'วิชาบังคับก่อน :  ENG23 2001 การเขียนโปรแกรมคอมพิวเตอร์ 2 ',
			' ',
			'การวิเคราะห์ขั้นตอนวิธีเบื้องต้น ความซับซ้อนของขั้นตอนวิธี ขั้นตอนวิธีในการเรียงลำดับและ',
			'ค้นหาข้อมูล โครงสร้างข้อมูลลิงค์ลิสต์ คิว สแตก ไบนารีทรี บีทรีและฮีพ กลยุทธ์ของขั้นตอนวิธี ',
			'ผลลัพธ์การเรียนรู้ที่คาดหวังระดับรายวิชา ',
			' ',
			'ผู้เรียนมีความรู้ความเข้าใจเกี่ยวกับหลักการวิเคราะห์ขั้นตอนวิธีแบบเบื้องต้น วิธีการวิเคราะห์',
			'ความซับซ้อนของขั้นตอนวิธีขั้นตอนวิธีและการวิเคราะห์ความซับซ้อนของขั้นตอนวิธีสำหรับการเรียงลำดับและ',
			'ค้นหาข้อมูลแบบต่างๆ ผู้เรียนทราบถึงความสำคัญของโครงสร้างข้อมูลและความแตกต่างของโครงสร้างข้อมูลแต่',
			'ละชนิด และสามารถเขียนโปรแกรมในระดับเบื้องต้นเพื่อสร้างโครงสร้างข้อมูลลิงค์ลิสต์ คิว สแตก ไบนารีทรี บีทรี',
			'และฮีพได้รวมถึงมีความรู้เกี่ยวกับกลยุทธ์ต่างๆ ของขั้นตอนวิธี ',
			' ',
			'ENG23 2032 ',
			'เทคโนโลยีเชิงวัตถุ ',
			'4(3-3-9) ',
			' ',
			'(Object–Oriented Technology) ',
			'วิชาบังคับก่อน :  ENG23 2001 การเขียนโปรแกรมคอมพิวเตอร์ 2 และ  ',
			' ',
			'ENG23 2003 การแก้ปัญหาด้วยการโปรแกรม ',
			' ',
			'แนวคิดเชิงวัตถุ การเขียนโปรแกรมเชิงวัตถุ คลาสและวัตถุ การห่อหุ้ม การสืบทอด  ',
			'โพลีมอร์ฟิสซึม อินเตอร์เฟสสายอักขระ การจัดการข้อผิดพลาด ',
			'ผลลัพธ์การเรียนรู้ที่คาดหวังระดับรายวิชา ',
			' ',
			'รายวิชาส่งเสริมให้เกิดแนวคิดด้านวัตถุ ผู้เรียนจะสามารถสร้างคลาสและวัตถุ รู้จักการห่อหุ้ม',
			'การสืบทอด ขบวนการโพลีมอร์ฟิสซิม และการจัดการข้อผิดพลาดที่เกิดขึ้นในโปรแกรม ',
			' ',
			' ',
			'ก-23 ',
			' ',
		]
		expect = [
			{
				'id': 'ENG23 2031',
				'code': 'ENG23 2031',
				'name': 'โครงสร้างข้อมูลและขั้นตอนวิธี',
				'credit': '4(4-0-8)',
				'description': 'การวิเคราะห์ขั้นตอนวิธีเบื้องต้น ความซับซ้อนของขั้นตอนวิธี ขั้นตอนวิธีในการเรียงลำดับและค้นหาข้อมูล โครงสร้างข้อมูลลิงค์ลิสต์ คิว สแตก ไบนารีทรี บีทรีและฮีพ กลยุทธ์ของขั้นตอนวิธี',
				'prerequisites': 'ENG23 2001 การเขียนโปรแกรมคอมพิวเตอร์ 2',
				'prerequisites_list': ['ENG23 2001'],
			},
			{
				'id': 'ENG23 2032',
				'code': 'ENG23 2032',
				'name': 'เทคโนโลยีเชิงวัตถุ',
				'credit': '4(3-3-9)',
				'description': 'แนวคิดเชิงวัตถุ การเขียนโปรแกรมเชิงวัตถุ คลาสและวัตถุ การห่อหุ้ม การสืบทอด โพลีมอร์ฟิสซึม อินเตอร์เฟสสายอักขระ การจัดการข้อผิดพลาด',
				'prerequisites': 'ENG23 2001 การเขียนโปรแกรมคอมพิวเตอร์ 2 และ  ENG23 2003 การแก้ปัญหาด้วยการโปรแกรม',
				'prerequisites_list': ['ENG23 2001', 'ENG23 2003'],
			},
		]
		extractor = CourseExtractor()

		result = extractor.extract_course_detail(input_lines)
		self.assertEqual(result, expect)


if __name__ == '__main__':
	unittest.main()
